Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter Class
 The ProfileItemParameter class contains the information of one profile parameter (property name, symbol, unit and unit type). A profile item can contain a maximum of 50 profile parameters.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItemParameter
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ProfileItemParameter
<SerializableAttribute>
Public NotInheritable Class ProfileItemParameter
The ProfileItemParameter type exposes the following members.
Constructors
Name | Description
ProfileItemParameter
Initializes a new instance of the ProfileItemParameter class
Top
Properties
Name | Description
AlblString
 Gets a translated albl string.
CrossSectionNumber
 The number of the cross section the parameter belongs to.
IntegerValue
 The integer value of the profile item parameter.
ParameterUnitType
 Defines the parameter unit type.
Property
 The description of the profile item parameter. Corresponds to the 'Property' in the Tekla Structures profile catalog dialog, and the 'Label in dialog box' in the variable dialog in the Sketch Editor.
StringValue
 The string value of the profile item parameter.
Symbol
 The symbol of the profile item parameter.
Value
 The value of the profile item parameter.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace